{
    "anal_masturbation": {
        "requires": "lib.slave.sex == MALE",
        "text": [
            "I'm going to let you masturbate and cum as much as you want today, on one condition: you must masturbate ONLY anally. No touching your cock."
        ]
    },
    "cake_ass": {
        "text": [
            "I'm going to let you eat one slice of cake for free today, on one condition: you must first smear it on your asshole, then scoop it out with your hands and eat it.<python>' If any of it falls on the floor, you must lick the floor clean.' if lib.slave.get_fact('clean_floor') else ''</python>"
        ]
    },
    "cake_trampled": {
        "requires": "lib.slave.get_fact('clean_floor')",
        "text": [
            "I'm going to let you eat one slice of cake for free today, on one condition: you must mash it up on the floor with your bare foot, then eat it off the floor like a dog. Lick your foot clean if you are flexible enough, or scrape it off with your hands and then eat it if you are not."
        ]
    },
    "eat_cum": {
        "requires": "lib.slave.sex == MALE",
        "text": [
            "I'm going to let you masturbate and cum once for free today, on one condition: you must eat your cum."
        ]
    },
    "edge_then_cum": {
        "text": [
            "I'm going to let you masturbate for free today. You can cum if and only if you first edge <python>random.randint(2, 5) * 5</python> times."
        ]
    },
    "games_competitive": {
        "text": [
            "You can play whatever competitive multiplayer games you want today, on one condition: you must play intentionally badly, but in a way that's subtle so the people you're playing with don't notice it's intentional. Try to lose as much as possible."
        ]
    },
    "pornstar": {
        "requires": "lib.slave.get_fact('video')",
        "text": [
            "You can masturbate and cum once for free today, on one condition: you must record a video of you doing it and upload the video to a porn site within the next week. You may edit the video to hide your identity."
        ]
    },
    "soil_underwear": {
        "requires": "lib.slave.sex == MALE",
        "text": [
            "I'm going to let you masturbate and cum once for free today, on one condition: you must cum in the underwear you are currently wearing."
        ]
    },
    "vaginal_masturbation": {
        "requires": "lib.slave.sex == FEMALE",
        "text": [
            "I'm going to masturbate and cum however much you want today, but ONLY by vaginal penetration. Don't even so much as touch your clit."
        ]
    },
    "work_for_it": {
        "text": [
            "Any time you want something that requires my permission today, you can do it for free if you do one of the following first: 250 jumping jacks, 300 knee raises, 100 burpees, 80 sit-ups, 80 crunches, 30 lunges, 80 squats, or 60 push-ups."
        ]
    }
}