[
    "You must ask for my permission before doing any of the following: masturbating, cumming, looking at porn, taking a bath or shower, changing or washing your underwear, eating junk food, drinking anything except plain water, using the toilet, or entertaining yourself (e.g. playing games).",
    "Immediately after you wake up every morning, you must report to me.",
    "During the day, you must report to me at least once every two hours if possible. If you can't report to me for a longer period of time (e.g. because of your job), you must report to me as soon as possible.",
    "You must ask for permission before going to bed each night. Once you go to bed, you are not to disturb me until morning, unless it's an emergency.",
    "You will sometimes be assigned a task in the morning. You are not required to do these tasks, but doing them will please me. If you choose to do them, they must be done on the day they are assigned. You can request additional tasks if you want to please me more.",
    "If you misbehave, you will be assigned punishments. You are not required to do these punishments, but I will forgive you sooner if you do.",
    "If a task or punishment you are assigned requires you to do something that normally requires permission, you have implicit permission to do it, but only if you complete the task or punishment. If you stop doing the task or punishment part-way through, anything you did that requires permission is a violation of rule 1.",
    "If you have a good reason related to your well-being to disregard one of my rules or commands (such as a medical condition), do so. In this case, the violation is exempt from punishment, so please don't report it to me.",
    "Except to avoid being punished for exempt violations, it is NEVER acceptable for you to lie to me. When I ask you a question, I expect to hear the truth.",
    "You must report all non-exempt violations of these rules to me as soon as possible, before asking me for anything. Failure to report your misdeeds before asking for something is considered to be dishonesty (lying), and you must report it as such."
]
