[
    "Immediately after you wake up every morning, you must report to me.",
    "During the day, unless you're sick, you must report to me at least once every hour if possible. If you can't report to me for any legitimate reason (e.g. because of your job), you must report to me as soon as possible.",
    "You may not masturbate or cum without my permission. Accidental RUINED orgasms  are exempt; there's no need to report those as violations. You can ruin an orgasm by immediately ceasing contact when you realize you're about to cum. Wet dreams are also exempt.",
    "You may not look at porn or read erotica without my permission.",
    "You may not take a bath or shower without my permission. This does not include things like being in the rain or swimming, but it does include things like hot tubs.",
    "You may not change or wash your underwear without my permission.",
    "You may not eat junk food without my permission.",
    "You may not drink anything other than plain water without my permission. This includes milk, juice, soda, and all alcoholic beverages.",
    "You may not pee without my permission. If you can't hold it any longer and accidentally pee as a result, that is not a violation of this rule as long as you stop the flow as quickly as you can. Additionally, if continuing to hold your bladder would be dangerous (this is the case if you start to feel actual pain, especially in the area of your kidneys, instead of the usual discomfort), you can and SHOULD pee until the amount of urine left in your bladder is safe, then stop the flow as quickly as you can.",
    "You may not entertain yourself without my permission. What this includes depends on you, but it should generally be activities you do by yourself solely for the sake of your enjoyment, such as watching TV or playing video games. It generally does not include any social activities, so playing games with other people does not necessarily require permission. I can't be bothered to learn enough about a worthless slave like you to know exactly which activities should be restricted, so I will trust your judgment.",
    "You must ask for permission before going to bed each night. Once you go to bed, you are not to disturb me until the next morning, unless you need something important.",
    "You will sometimes be assigned a task in the morning for my pleasure. Do them consistently, and you will be rewarded. They must be done on the day they are assigned. If you want to please me more, ask me, but don't waste my time with this if you can't actually do another task.",
    "If you misbehave, you will be assigned punishments. You don't have to carry them out immediately, but I am far less kind to slaves that have unpunished misdeeds, so it's in your best interest to complete them as soon as possible. If a punishment is out of the question, you might be able to make me forget about your misdeed faster by doing more tasks to please me.",
    "If a task or punishment you are assigned requires you to do something that normally requires my permission, you have implicit permission to do it, but only if you complete the task or punishment. If you stop doing the task or punishment part-way through, anything you did that requires my permission is a violation of the respective rule, and you must report it as such.",
    "If anyone else gives you a direct order to do something that normally requires my permission, you can and should obey them without asking me for permission. This exemption does not apply if you were the one who suggested that you should do the activity. It also does not apply to anything that is not a direct order, like a mere offer or grant of permission. In these cases, my permission is still required.",
    "If you have a good reason related to your well-being to disregard one of my rules or commands (such as a medical condition), do so. In this case, the violation is exempt from punishment, so please don't report it to me.",
    "Please tell me if you are sick at the earliest opportunity. I am more lenient toward sick slaves than I otherwise am.",
    "Except to avoid being punished for exempt violations, it is NEVER acceptable for you to lie to me. When I ask you a question, I expect to hear the truth.",
    "You must report all non-exempt violations of these rules to me as soon as possible, before asking me for anything. Failure to report your misdeeds before asking for something is considered to be dishonesty (lying), and you must report it as such."
]
