{
    "ask_what": [
        "What is it?",
        "Let's hear it.",
        "Tell me.",
        "What do you need to tell me?",
        "Go on."
    ],
    "ask_what_naughty": [
        "What did you do?",
        "Confess, then."
    ],
    "choice_completed_chore": [
        "I finished my task."
    ],
    "choice_completed_punishment": [
        "I carried out a punishment."
    ],
    "choice_naughty": [
        "I broke a rule."
    ],
    "choice_lied": [
        "I lied to you."
    ],
    "choice_nothing": [
        "Nothing.",
        "Nevermind."
    ],
    "choice_naughty_masturbation": [
        "Masturbated without permission."
    ],
    "choice_naughty_porn": [
        "Watched porn without permission."
    ],
    "choice_naughty_shower": [
        "Took a bath or shower without permission."
    ],
    "choice_naughty_junk_food": [
        "Ate junk food without permission."
    ],
    "choice_naughty_drink": [
        "Drank something other than water without permission."
    ],
    "choice_naughty_toilet": [
        "Used the toilet without permission."
    ],
    "choice_naughty_fun": [
        "Entertained myself without permission."
    ],
    "choice_special_naughty_bed": [
        "Went to bed without permission."
    ],
    "choice_special_naughty_nothing": [
        "Nothing."
    ],
    "chore_check": [
        "Just to double-check, you did this task?",
        "Just to be absolutely sure, this is the task you completed?",
        "This one?",
        "Is this the right one?",
        "You did this task?"
    ],
    "chore_done": [
        "That's a good slave.",
        "I am pleased, slave.",
        "What an adorable slut you are.",
        "Very good.",
        "Doesn't it feel great to please me?"
    ],
    "no_chore": [
        "What are you talking about? You don't have a task right now.",
        "What task? I haven't given you one recently.",
        "Are you trying to trick me, slave? It won't work. If I had given you a task to do, I would remember it.",
        "Don't test my patience. You don't have any task."
    ],
    "no_punishment": [
        "What are you talking about? You don't have any punishments to carry out.",
        "What punishment? You don't have any punishments to do right now.",
        "Punishment? What are you talking about? You don't have any punishments right now.",
        "I don't recall assigning any punishments to you recently."
    ],
    "punishment_check": [
        "Just to double-check, you did this punishment?",
        "Just to be absolutely sure, this is the punishment you carried out?",
        "This one?",
        "Is this the right one?",
        "You did this punishment?"
    ],
    "punishment_done": [
        "Good. I hope you learned your lesson.",
        "Good. Behave yourself next time!"
    ],
    "response_naughty_masturbation": [
        "Touching yourself without my permission, are you?",
        "You know better than to touch yourself without my permission.",
        "I will not tolerate this, slave. That's MY property you were playing with!",
        "Your lack of discipline is atrocious!",
        "I choose when you masturbate, not you!",
        "You filthy whore! How dare you masturbate without my permission?!"
    ],
    "response_naughty_orgasm": [
        "I did not give you permission to cum yet!",
        "Filthy bitch! When did I say you could cum?!",
        "Fucking cumming before I tell you to? Who do you think you are?",
        "Fucking whore! You do not cum without my permission!"
    ],
    "response_naughty_porn": [
        "Filthy slut!",
        "Fucking pervert! Who do you think you are?",
        "You know better than to look at porn without my permission!"
    ],
    "response_naughty_shower": [
        "Washing up is a privilege for you, not a right!",
        "Whether you get to be clean is for me to decide, not you!",
        "Have you forgotten, slave? I control your life!"
    ],
    "response_naughty_junk_food": [
        "Gluttonous pig! You do not eat junk food without my permission!",
        "You need to learn self-restraint.",
        "I choose when you get to indulge in that worthless junk, not you!",
        "I will not stand idly by and allow you to eat shit like a pig!"
    ],
    "response_naughty_drink": [
        "Drinking crap that you don't need, are you?",
        "Slaves don't need special drinks!",
        "For a worthless slave like you, drinks are a privilege, not a right!",
        "How dare you treat yourself to special drinks without my permission?"
    ],
    "response_naughty_toilet": [
        "I choose when you get to use the toilet, not you!",
        "Do you have no discipline at all?",
        "Do you forget that you are my slave? I choose when you get to use the toilet."
    ],
    "response_naughty_fun": [
        "Lazy bitch! I decide when you get to entertain yourself.",
        "I choose when you get to waste your time, not you!",
        "I don't appreciate laziness, slave."
    ],
    "response_naughty_bed": [
        "Who do you think you are, slave?",
        "I control your life! That includes going to bed.",
        "Have you been avoiding me? That is unacceptable."
    ],
    "response_lied": [
        "Lying to your <python>'mistress' if lib.master.sex == FEMALE else 'master'</python> is intolerable!",
        "You fucking piece of shit! Lying to me!",
        "You fucking lied to me?! Nothing is worse than lying to your <python>'mistress' if lib.master.sex == FEMALE else 'master'</python>!",
        "Filthy bitch! I am not going to let this slide!"
    ]
}
