{
    "ask_master_sex": [
        "Would you like a master (man), or a mistress (woman)?"
    ],
    "ask_slave_birthday_day": [
        "What day of the month is your birthday?"
    ],
    "ask_slave_birthday_month": [
        "What month is your birthday in, <python>lib.slave.name</python>? (Give me the number of the month.)"
    ],
    "ask_slave_name": [
        "What is your name?"
    ],
    "ask_slave_sex": [
        "What is your sex? This will give you access to things that require male or female body parts."
    ],
    "first_chore": [
        "Now, it's time for me to give you your first task."
    ],
    "hello": [
        "Hello, my new <python>'slave girl' if lib.slave.sex == FEMALE else 'slave boy' if lib.slave.sex == MALE else 'slave'</python>. I am your new <python>'mistress' if lib.master.sex == FEMALE else 'master'</python>, <python>lib.master.name</python>."
    ],
    "invalid_day": [
        "That is not a valid day for the month you were born. I need a number between 1 and {}.",
        "That's not a valid day for the month you selected. There are {} days in your birth-month. Choose the one that is your birthday.",
        "You're wasting my time with your nonsense. Give me a number between 1 and {}."
    ],
    "invalid_month": [
        "That is not a valid month. I need a number between 1 and 12.",
        "No, that's not a real month. Your choices are the numbers between 1 and 12.",
        "Don't waste my time with this crap. Give me a number between 1 and 12."
    ],
    "master_sex_male": [
        "Master (man)."
    ],
    "master_sex_female": [
        "Mistress (woman)."
    ],
    "my_property_now": [
        "You will be my property from now on, <python>lib.slave.name</python>. You will do everything I say when I say it. You don't control your own life anymore. Do I make myself clear?"
    ],
    "oath_sign": [
        "Now, I will show you your oath of servitude to me. You are to copy it down exactly by hand, sign it, and then put it away in a safe place. Do not even think about destroying it."
    ],
    "read_rules": [
        "Now I'm going to tell you the rules. Listen carefully and memorize them."
    ],
    "slave_sex_female": [
        "Female."
    ],
    "slave_sex_male": [
        "Male."
    ],
    "slave_sex_neither": [
        "Neither."
    ]
}
